{
  "jobData": [
    {
      "title": "Service Technician - job post",
      "companyElement": "WaterTec",
      "description": "Job Description\nThis is a full-time position located in our Langley office. The Service Technician supports the Sales and Project teams. This individual is expected to possess high interpersonal, communication, and troubleshooting skills. They will represent WaterTec’s reputation for excellence in the irrigation market. \nDuties Include\n*Perform diagnostics on agricultural irrigation hose reels, pumps, and sprayers, and determine the required parts and repairs.\n*Perform repairs on the above either in the field or in the shop. \n*Support shop fabrication projects (welding, assembly, and machining) as required.\n*Interact with management, sales, and purchasing teams. \n*Seasonal maintenance on rental and company equipment.\n*Complete documentation for work orders and service as required by company procedures in a timely manner.\n*Follow and promote safe work practices.\nEducation (Preferred):\nBroad-based technical skills encompassing controls, hydraulics, electrical and mechanical knowledge.\n5 years of prior experience with repair, service, or other fieldwork preferably in the agriculture industry.\nA technical college degree or other certification is an asset.\nOther Requirements:\nComputer skills\nGood customer service skills\nValid driver's license and ability to drive to work as service yard is not on a transit line.\nThis position requires a criminal records check.\nWhy Work for WaterTec\nWhen you work for WaterTec, you are family. Our culture is defined by the foundations that we build with respect, and trust while supporting each other and their families, and giving back to our community.\nWe offer an extremely competitive salary and benefits package with opportunities for growth and advancement within the company. We are passionate about providing our team with the best management and training support available while ensuring a dynamic team atmosphere\nJob Type: Full-time",
      "site": "Indeed",
      "url": "https://ca.indeed.com/viewjob?jk=57c256f468b4df57",
      "userId": 12345567,
      "id": 1
    }
  ]
}